Revit 2026 API

# ElementIntersectsSolidFilter(Solid) Constructor

---

Constructs a filter to match elements which intersect the given element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementIntersectsSolidFilter(
	Solid solid
)
```
```vb
Public Sub New (
	solid As Solid
)
```
```cpp
public:
ElementIntersectsSolidFilter(
	Solid^ solid
)
```
```fsharp
new :
        solid : Solid -> ElementIntersectsSolidFilter
```

#### Parameters

solid Solid
     The solid geometry to check for intersection.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ElementIntersectsSolidFilter Class

ElementIntersectsSolidFilter Overload

Autodesk.Revit.DB Namespace